; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph1 - mode
	thermograph0 - mode
	thermograph2 - mode
	Star1 - direction
	Star3 - direction
	Star4 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Star6 - direction
	Star8 - direction
	GroundStation0 - direction
	GroundStation7 - direction
	GroundStation11 - direction
	Star5 - direction
	GroundStation2 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star6)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 Star8)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star16)
)
(:goal (and
	(have_image Star12 thermograph2)
	(have_image Star13 thermograph2)
	(have_image Phenomenon14 thermograph0)
	(have_image Star15 thermograph1)
	(have_image Star16 thermograph0)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 thermograph0)
))

)

; plan
1. (turn_to satellite0 groundstation11 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation11)
   goals met: 0 of 7
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite0 instrument2 groundstation11)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite0 planet18 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 planet18)
   goals met: 0 of 7
5. (take_image satellite0 planet18 instrument2 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon17 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon17 instrument2 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon14 instrument2 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 3 of 7
10. (turn_to satellite0 star12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star12)
   goals met: 3 of 7
11. (take_image satellite0 star12 instrument2 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 4 of 7
12. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 4 of 7
13. (take_image satellite0 star13 instrument2 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 5 of 7
14. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 5 of 7
15. (take_image satellite0 star15 instrument2 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 6 of 7
16. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 6 of 7
17. (take_image satellite0 star16 instrument2 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 7 of 7
